Repository: Nets-mobile-acceptance/Netaxept-iOS-SDK
Catalog: PiaSample/PiaSample/*.lproj/Localizable.strings
Languages: fi, ro, sv

source: Card has expired. Please select a valid card!
fi: Kortti ei ole voimassa. Ole hyvä, valitse voimassaoleva kortti
ro: Cardul a expirat. Te rugam sa selectezi un card valid!
sv: Kortet utgånget. Välj ett giltigt kort!

source: Choose a payment method
fi: Valitse maksutapa
ro: Alege o metoda de plata
sv: Välj betalmetod

source: Credit cards
fi: Luottokortit
ro: Carduri de credit
sv: Kort

source: Other
fi: Muut
ro: Alta
sv: Andra

source: Payment method not supported
fi: Maksutapa ei tuettu
ro: Metoda nu e suportata
sv: Betalmetod stöds ej

source: Please add a non-zero value.
fi: Ole hyvä, syötä arvo
ro: Te rugam sa adaugi o valoare ne-nula.
sv: Var vänlig ange ett värde större än noll

source: Production
fi: Tuotanto
ro: Productie
sv: Produktion

source: Test
fi: Testi

source: There was an error when rolling back the transaction.
fi: Virhe tapahtuman peruutuksessa
ro: Eroare la anularea tranzactiei.
sv: Ett fel inträffade vid reverering av transaktionen

source: There was an unexpected error. Please contact customer service if the problem persists.
fi: Odottamaton virhe. Ole hyvä, ota yhteyttä asiakaspalveluun jos ongelma jatkuu
ro: Eroare nedefinita. Te rugam sa contactezi serviciul suport daca problema persista.
sv: Ett oväntat fel inträffade. Var vänlig kontakta kundtjänst om problemet kvarstår.

source: There was an unexpected error. Please contact customer service if the problem persists.
fi: Odottamaton virhe. Ole hyvä, ota yhteyttä asiakaspalveluun jos ongelma jatkuu
ro: Eroare nedefinita. Te rugam sa contactezi serviciul suport daca problema persista.
sv: Ett oväntat fel inträffade. Var vänlig kontakta kundtjänst om problemet kvarstår.

source: You cancelled the transaction.
fi: Keskeytit tapahtuman
ro: Ati anulat tranzactia.
sv: Transaktionen avbruten

source: Your payment was approved. You will receive the items within 1-3 business days.
fi: Maksu on hyväksytty. Saat tuotteet 1-3 arkipäivässä
ro: Plata a fost aprobata. Veti primi produsele in 1-3 zile lucratoare
sv: Betalning godkänd. Du kan räkna med att få varorna inom 1-3 arbetsdagar.

source: CANCEL
fi: KESKEYTÄ
ro: ANULARE
sv: AVBRYT

source: Pay
fi: Maksu
ro: Plata
sv: Betala

source: Card saved
fi: Kortti talletettu
ro: Card salvat
sv: Kort sparat

source: Your card has been saved
fi: Korttisi on talletettu
ro: Cardul dumneavoastra a fost salvat
sv: Ditt kort har sparats

source: Payment completed
fi: Maksu suoritettu
ro: Plata completa
sv: Betalning klar

source: Thanks for shopping
fi: Kiitos ostoksista
ro: Multumim pentru cumparaturi
sv: Tack för att du handlar

source: Failed
fi: Epäonnistui
ro: Eroare
sv: Fel

source: There was an error. Please try again later
fi: Virhe, yritä myöhemmin uudestaan
ro: A aparut o eroare. Va rugam sa incercati din nou
sv: Ett fel inträffade. Försök igen senare

source: Cancelled
fi: Keskeytetty
ro: Anulat
sv: Avbrutet

source: Process is cancelled
fi: Tapahtuma keskeytetty
ro: Procesul a fost anulat
sv: Bearbetning avbruten

source: Payment with Vipps failed
fi: Maksu Vippillä epäonnistui
ro: Plata cu Vipps a eșuat
sv: Betalning med Vipps misslyckades
